In [39]:
import pandas as pd

df_links = pd.read_csv("Data/links.csv")
df_links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [40]:
df_links.count()

movieId    86537
imdbId     86537
tmdbId     86411
dtype: int64

In [41]:
# Hur m책nga rader som saknar v채rde i varje kolumn
df_links.isna().sum()

movieId      0
imdbId       0
tmdbId     126
dtype: int64

In [42]:
df_movies = pd.read_csv("Data/movies.csv")
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [43]:
df_movies.count()

movieId    86537
title      86537
genres     86537
dtype: int64

In [44]:
df_ratings = pd.read_csv("Data/ratings.csv")
df_ratings.head()

   userId  movieId  rating   timestamp
0       1        1     4.0  1225734739
1       1      110     4.0  1225865086
2       1      158     4.0  1225733503
3       1      260     4.5  1225735204
4       1      356     5.0  1225735119

In [45]:
df_ratings.count()

userId       33832162
movieId      33832162
rating       33832162
timestamp    33832162
dtype: int64

In [46]:
df_tags = pd.read_csv("Data/tags.csv")
df_tags.head()

   userId  movieId            tag   timestamp
0      10      260   good vs evil  1430666558
1      10      260  Harrison Ford  1430666505
2      10      260         sci-fi  1430666538
3      14     1221      Al Pacino  1311600756
4      14     1221          mafia  1311600746

In [47]:
df_tags.count()

userId       2328315
movieId      2328315
tag          2328298
timestamp    2328315
dtype: int64

In [48]:
# Hur m책nga rader som saknar v채rde i varje kolumn
df_tags.isna().sum()

userId        0
movieId       0
tag          17
timestamp     0
dtype: int64